#!/usr/bin/env sh

# остановить публикацию при ошибках

# сборка
git checkout master

<<<<<<< HEAD
$ echo "--------------------------------------------"
git merge dev

$ echo "--------------------------------------------"
git status

$ echo "--------------------------------------------"
npm run build

$ echo "--------------------------------------------"
=======
echo "--------------------------------------------"
git merge dev

echo "--------------------------------------------"
git status

echo "--------------------------------------------"
npm run build

echo "--------------------------------------------"
>>>>>>> dev
git add -A

$ echo "--------------------------------------------"
git commit -m "new build $(date '+%d-%m-%y %H:%M:%S')"

<<<<<<< HEAD
$ echo "--------------------------------------------"
git push origin master

$ echo "--------------------------------------------"
git subtree push --prefix dist origin prod

$ echo "--------------------------------------------"
=======
echo "--------------------------------------------"
git push origin master

echo "--------------------------------------------"
git subtree push --prefix dist origin prod

echo "--------------------------------------------"
>>>>>>> dev
git checkout dev

$SHELL


